Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 441, 399, 1) 0
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 441, 399, 32) 288         input_1[0][0]
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 441, 399, 32) 128         conv2d[0][0]
__________________________________________________________________________________________________
leaky_re_lu (LeakyReLU)         (None, 441, 399, 32) 0           batch_normalization[0][0]
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 221, 200, 64) 18432       leaky_re_lu[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 221, 200, 64) 256         conv2d_1[0][0]
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 221, 200, 64) 0           batch_normalization_1[0][0]
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 221, 200, 64) 4096        leaky_re_lu_1[0][0]
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 221, 200, 64) 256         conv2d_3[0][0]
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 221, 200, 64) 0           batch_normalization_3[0][0]
__________________________________________________________________________________________________
add (Add)                       (None, 221, 200, 64) 0           leaky_re_lu_1[0][0]
                                                                 leaky_re_lu_3[0][0]
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 111, 100, 128 73728       add[0][0]
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 111, 100, 128 512         conv2d_4[0][0]
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 111, 100, 128 0           batch_normalization_4[0][0]
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 111, 100, 128 16384       leaky_re_lu_4[0][0]
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 111, 100, 128 512         conv2d_6[0][0]
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 111, 100, 128 0           batch_normalization_6[0][0]
__________________________________________________________________________________________________
add_1 (Add)                     (None, 111, 100, 128 0           leaky_re_lu_4[0][0]
                                                                 leaky_re_lu_6[0][0]
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 111, 100, 128 16384       add_1[0][0]
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 111, 100, 128 512         conv2d_8[0][0]
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 111, 100, 128 0           batch_normalization_8[0][0]
__________________________________________________________________________________________________
add_2 (Add)                     (None, 111, 100, 128 0           add_1[0][0]
                                                                 leaky_re_lu_8[0][0]
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 56, 50, 256)  294912      add_2[0][0]
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 56, 50, 256)  1024        conv2d_9[0][0]
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, 56, 50, 256)  0           batch_normalization_9[0][0]
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 56, 50, 256)  65536       leaky_re_lu_9[0][0]
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 56, 50, 256)  1024        conv2d_11[0][0]
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, 56, 50, 256)  0           batch_normalization_11[0][0]
__________________________________________________________________________________________________
add_3 (Add)                     (None, 56, 50, 256)  0           leaky_re_lu_9[0][0]
                                                                 leaky_re_lu_11[0][0]
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 56, 50, 256)  65536       add_3[0][0]
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 56, 50, 256)  1024        conv2d_13[0][0]
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (None, 56, 50, 256)  0           batch_normalization_13[0][0]
__________________________________________________________________________________________________
add_4 (Add)                     (None, 56, 50, 256)  0           add_3[0][0]
                                                                 leaky_re_lu_13[0][0]
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 56, 50, 256)  65536       add_4[0][0]
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 56, 50, 256)  1024        conv2d_15[0][0]
__________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)      (None, 56, 50, 256)  0           batch_normalization_15[0][0]
__________________________________________________________________________________________________
add_5 (Add)                     (None, 56, 50, 256)  0           add_4[0][0]
                                                                 leaky_re_lu_15[0][0]
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 56, 50, 256)  65536       add_5[0][0]
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 56, 50, 256)  1024        conv2d_17[0][0]
__________________________________________________________________________________________________
leaky_re_lu_17 (LeakyReLU)      (None, 56, 50, 256)  0           batch_normalization_17[0][0]
__________________________________________________________________________________________________
add_6 (Add)                     (None, 56, 50, 256)  0           add_5[0][0]
                                                                 leaky_re_lu_17[0][0]
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 56, 50, 256)  65536       add_6[0][0]
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 56, 50, 256)  1024        conv2d_19[0][0]
__________________________________________________________________________________________________
leaky_re_lu_19 (LeakyReLU)      (None, 56, 50, 256)  0           batch_normalization_19[0][0]
__________________________________________________________________________________________________
add_7 (Add)                     (None, 56, 50, 256)  0           add_6[0][0]
                                                                 leaky_re_lu_19[0][0]
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 56, 50, 256)  65536       add_7[0][0]
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 56, 50, 256)  1024        conv2d_21[0][0]
__________________________________________________________________________________________________
leaky_re_lu_21 (LeakyReLU)      (None, 56, 50, 256)  0           batch_normalization_21[0][0]
__________________________________________________________________________________________________
add_8 (Add)                     (None, 56, 50, 256)  0           add_7[0][0]
                                                                 leaky_re_lu_21[0][0]
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 56, 50, 256)  65536       add_8[0][0]
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 56, 50, 256)  1024        conv2d_23[0][0]
__________________________________________________________________________________________________
leaky_re_lu_23 (LeakyReLU)      (None, 56, 50, 256)  0           batch_normalization_23[0][0]
__________________________________________________________________________________________________
add_9 (Add)                     (None, 56, 50, 256)  0           add_8[0][0]
                                                                 leaky_re_lu_23[0][0]
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 56, 50, 256)  65536       add_9[0][0]
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 56, 50, 256)  1024        conv2d_25[0][0]
__________________________________________________________________________________________________
leaky_re_lu_25 (LeakyReLU)      (None, 56, 50, 256)  0           batch_normalization_25[0][0]
__________________________________________________________________________________________________
add_10 (Add)                    (None, 56, 50, 256)  0           add_9[0][0]
                                                                 leaky_re_lu_25[0][0]
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 28, 25, 512)  1179648     add_10[0][0]
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 28, 25, 512)  2048        conv2d_26[0][0]
__________________________________________________________________________________________________
leaky_re_lu_26 (LeakyReLU)      (None, 28, 25, 512)  0           batch_normalization_26[0][0]
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 28, 25, 512)  262144      leaky_re_lu_26[0][0]
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 28, 25, 512)  2048        conv2d_28[0][0]
__________________________________________________________________________________________________
leaky_re_lu_28 (LeakyReLU)      (None, 28, 25, 512)  0           batch_normalization_28[0][0]
__________________________________________________________________________________________________
add_11 (Add)                    (None, 28, 25, 512)  0           leaky_re_lu_26[0][0]
                                                                 leaky_re_lu_28[0][0]
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 28, 25, 512)  262144      add_11[0][0]
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 28, 25, 512)  2048        conv2d_30[0][0]
__________________________________________________________________________________________________
leaky_re_lu_30 (LeakyReLU)      (None, 28, 25, 512)  0           batch_normalization_30[0][0]
__________________________________________________________________________________________________
add_12 (Add)                    (None, 28, 25, 512)  0           add_11[0][0]
                                                                 leaky_re_lu_30[0][0]
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 28, 25, 512)  262144      add_12[0][0]
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 28, 25, 512)  2048        conv2d_32[0][0]
__________________________________________________________________________________________________
leaky_re_lu_32 (LeakyReLU)      (None, 28, 25, 512)  0           batch_normalization_32[0][0]
__________________________________________________________________________________________________
add_13 (Add)                    (None, 28, 25, 512)  0           add_12[0][0]
                                                                 leaky_re_lu_32[0][0]
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 28, 25, 512)  262144      add_13[0][0]
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 28, 25, 512)  2048        conv2d_34[0][0]
__________________________________________________________________________________________________
leaky_re_lu_34 (LeakyReLU)      (None, 28, 25, 512)  0           batch_normalization_34[0][0]
__________________________________________________________________________________________________
add_14 (Add)                    (None, 28, 25, 512)  0           add_13[0][0]
                                                                 leaky_re_lu_34[0][0]
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 28, 25, 512)  262144      add_14[0][0]
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, 28, 25, 512)  2048        conv2d_36[0][0]
__________________________________________________________________________________________________
leaky_re_lu_36 (LeakyReLU)      (None, 28, 25, 512)  0           batch_normalization_36[0][0]
__________________________________________________________________________________________________
add_15 (Add)                    (None, 28, 25, 512)  0           add_14[0][0]
                                                                 leaky_re_lu_36[0][0]
__________________________________________________________________________________________________
conv2d_38 (Conv2D)              (None, 28, 25, 512)  262144      add_15[0][0]
__________________________________________________________________________________________________
batch_normalization_38 (BatchNo (None, 28, 25, 512)  2048        conv2d_38[0][0]
__________________________________________________________________________________________________
leaky_re_lu_38 (LeakyReLU)      (None, 28, 25, 512)  0           batch_normalization_38[0][0]
__________________________________________________________________________________________________
add_16 (Add)                    (None, 28, 25, 512)  0           add_15[0][0]
                                                                 leaky_re_lu_38[0][0]
__________________________________________________________________________________________________
conv2d_40 (Conv2D)              (None, 28, 25, 512)  262144      add_16[0][0]
__________________________________________________________________________________________________
batch_normalization_40 (BatchNo (None, 28, 25, 512)  2048        conv2d_40[0][0]
__________________________________________________________________________________________________
leaky_re_lu_40 (LeakyReLU)      (None, 28, 25, 512)  0           batch_normalization_40[0][0]
__________________________________________________________________________________________________
add_17 (Add)                    (None, 28, 25, 512)  0           add_16[0][0]
                                                                 leaky_re_lu_40[0][0]
__________________________________________________________________________________________________
conv2d_42 (Conv2D)              (None, 28, 25, 512)  262144      add_17[0][0]
__________________________________________________________________________________________________
batch_normalization_42 (BatchNo (None, 28, 25, 512)  2048        conv2d_42[0][0]
__________________________________________________________________________________________________
leaky_re_lu_42 (LeakyReLU)      (None, 28, 25, 512)  0           batch_normalization_42[0][0]
__________________________________________________________________________________________________
add_18 (Add)                    (None, 28, 25, 512)  0           add_17[0][0]
                                                                 leaky_re_lu_42[0][0]
__________________________________________________________________________________________________
conv2d_43 (Conv2D)              (None, 14, 13, 1024) 4718592     add_18[0][0]
__________________________________________________________________________________________________
batch_normalization_43 (BatchNo (None, 14, 13, 1024) 4096        conv2d_43[0][0]
__________________________________________________________________________________________________
leaky_re_lu_43 (LeakyReLU)      (None, 14, 13, 1024) 0           batch_normalization_43[0][0]
__________________________________________________________________________________________________
conv2d_45 (Conv2D)              (None, 14, 13, 1024) 1048576     leaky_re_lu_43[0][0]
__________________________________________________________________________________________________
batch_normalization_45 (BatchNo (None, 14, 13, 1024) 4096        conv2d_45[0][0]
__________________________________________________________________________________________________
leaky_re_lu_45 (LeakyReLU)      (None, 14, 13, 1024) 0           batch_normalization_45[0][0]
__________________________________________________________________________________________________
add_19 (Add)                    (None, 14, 13, 1024) 0           leaky_re_lu_43[0][0]
                                                                 leaky_re_lu_45[0][0]
__________________________________________________________________________________________________
conv2d_47 (Conv2D)              (None, 14, 13, 1024) 1048576     add_19[0][0]
__________________________________________________________________________________________________
batch_normalization_47 (BatchNo (None, 14, 13, 1024) 4096        conv2d_47[0][0]
__________________________________________________________________________________________________
leaky_re_lu_47 (LeakyReLU)      (None, 14, 13, 1024) 0           batch_normalization_47[0][0]
__________________________________________________________________________________________________
add_20 (Add)                    (None, 14, 13, 1024) 0           add_19[0][0]
                                                                 leaky_re_lu_47[0][0]
__________________________________________________________________________________________________
conv2d_49 (Conv2D)              (None, 14, 13, 1024) 1048576     add_20[0][0]
__________________________________________________________________________________________________
batch_normalization_49 (BatchNo (None, 14, 13, 1024) 4096        conv2d_49[0][0]
__________________________________________________________________________________________________
leaky_re_lu_49 (LeakyReLU)      (None, 14, 13, 1024) 0           batch_normalization_49[0][0]
__________________________________________________________________________________________________
add_21 (Add)                    (None, 14, 13, 1024) 0           add_20[0][0]
                                                                 leaky_re_lu_49[0][0]
__________________________________________________________________________________________________
conv2d_51 (Conv2D)              (None, 14, 13, 1024) 1048576     add_21[0][0]
__________________________________________________________________________________________________
batch_normalization_51 (BatchNo (None, 14, 13, 1024) 4096        conv2d_51[0][0]
__________________________________________________________________________________________________
leaky_re_lu_51 (LeakyReLU)      (None, 14, 13, 1024) 0           batch_normalization_51[0][0]
__________________________________________________________________________________________________
add_22 (Add)                    (None, 14, 13, 1024) 0           add_21[0][0]
                                                                 leaky_re_lu_51[0][0]
==================================================================================================
Total params: 13,188,512
Trainable params: 13,163,360
Non-trainable params: 25,152
__________________________________________________________________________________________________