Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 399, 441, 1) 0
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 200, 221, 64) 576         input_1[0][0]
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 200, 221, 64) 256         conv2d[0][0]
__________________________________________________________________________________________________
leaky_re_lu (LeakyReLU)         (None, 200, 221, 64) 0           batch_normalization[0][0]
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 200, 221, 32) 2048        leaky_re_lu[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 200, 221, 32) 128         conv2d_1[0][0]
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 200, 221, 32) 0           batch_normalization_1[0][0]
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 200, 221, 32) 1056        leaky_re_lu_1[0][0]
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 200, 221, 64) 4160        leaky_re_lu[0][0]
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 200, 221, 96) 0           conv2d_2[0][0]
                                                                 conv2d_3[0][0]
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 200, 221, 128 12288       concatenate[0][0]
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 200, 221, 128 512         conv2d_4[0][0]
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 200, 221, 128 0           batch_normalization_2[0][0]
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 100, 111, 128 147456      leaky_re_lu_2[0][0]
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 100, 111, 128 512         conv2d_5[0][0]
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 100, 111, 128 0           batch_normalization_3[0][0]
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 100, 111, 64) 8192        leaky_re_lu_3[0][0]
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 100, 111, 64) 256         conv2d_6[0][0]
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 100, 111, 64) 0           batch_normalization_4[0][0]
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 100, 111, 64) 4096        leaky_re_lu_4[0][0]
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 100, 111, 64) 256         conv2d_7[0][0]
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 100, 111, 64) 0           batch_normalization_5[0][0]
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 100, 111, 64) 36864       leaky_re_lu_5[0][0]
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 100, 111, 64) 256         conv2d_8[0][0]
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 100, 111, 64) 0           batch_normalization_6[0][0]
__________________________________________________________________________________________________
add (Add)                       (None, 100, 111, 64) 0           leaky_re_lu_4[0][0]
                                                                 leaky_re_lu_6[0][0]
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 100, 111, 64) 4096        add[0][0]
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 100, 111, 64) 256         conv2d_9[0][0]
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 100, 111, 64) 0           batch_normalization_7[0][0]
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 100, 111, 64) 36864       leaky_re_lu_7[0][0]
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 100, 111, 64) 256         conv2d_10[0][0]
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 100, 111, 64) 0           batch_normalization_8[0][0]
__________________________________________________________________________________________________
add_1 (Add)                     (None, 100, 111, 64) 0           add[0][0]
                                                                 leaky_re_lu_8[0][0]
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 100, 111, 64) 4160        add_1[0][0]
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 100, 111, 128 16512       leaky_re_lu_3[0][0]
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 100, 111, 192 0           conv2d_11[0][0]
                                                                 conv2d_12[0][0]
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 100, 111, 256 49152       concatenate_1[0][0]
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 100, 111, 256 1024        conv2d_13[0][0]
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, 100, 111, 256 0           batch_normalization_9[0][0]
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 50, 56, 256)  589824      leaky_re_lu_9[0][0]
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 50, 56, 256)  1024        conv2d_14[0][0]
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (None, 50, 56, 256)  0           batch_normalization_10[0][0]
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 50, 56, 128)  32768       leaky_re_lu_10[0][0]
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 50, 56, 128)  512         conv2d_15[0][0]
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, 50, 56, 128)  0           batch_normalization_11[0][0]
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 50, 56, 128)  16384       leaky_re_lu_11[0][0]
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 50, 56, 128)  512         conv2d_16[0][0]
__________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)      (None, 50, 56, 128)  0           batch_normalization_12[0][0]
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 50, 56, 128)  147456      leaky_re_lu_12[0][0]
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 50, 56, 128)  512         conv2d_17[0][0]
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (None, 50, 56, 128)  0           batch_normalization_13[0][0]
__________________________________________________________________________________________________
add_2 (Add)                     (None, 50, 56, 128)  0           leaky_re_lu_11[0][0]
                                                                 leaky_re_lu_13[0][0]
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 50, 56, 128)  16384       add_2[0][0]
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 50, 56, 128)  512         conv2d_18[0][0]
__________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)      (None, 50, 56, 128)  0           batch_normalization_14[0][0]
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 50, 56, 128)  147456      leaky_re_lu_14[0][0]
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 50, 56, 128)  512         conv2d_19[0][0]
__________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)      (None, 50, 56, 128)  0           batch_normalization_15[0][0]
__________________________________________________________________________________________________
add_3 (Add)                     (None, 50, 56, 128)  0           add_2[0][0]
                                                                 leaky_re_lu_15[0][0]
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 50, 56, 128)  16512       add_3[0][0]
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 50, 56, 256)  65792       leaky_re_lu_10[0][0]
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 50, 56, 384)  0           conv2d_20[0][0]
                                                                 conv2d_21[0][0]
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 50, 56, 512)  196608      concatenate_2[0][0]
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 50, 56, 512)  2048        conv2d_22[0][0]
__________________________________________________________________________________________________
leaky_re_lu_16 (LeakyReLU)      (None, 50, 56, 512)  0           batch_normalization_16[0][0]
__________________________________________________________________________________________________
dense (Dense)                   (None, 50, 56, 576)  295488      leaky_re_lu_16[0][0]
__________________________________________________________________________________________________
reshape (Reshape)               (None, 64, 36, 700)  0           dense[0][0]
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 64, 36, 64)   403264      reshape[0][0]
__________________________________________________________________________________________________
leaky_re_lu_17 (LeakyReLU)      (None, 64, 36, 64)   0           conv2d_23[0][0]
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 64, 36, 64)   36928       leaky_re_lu_17[0][0]
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 64, 36, 64)   256         conv2d_24[0][0]
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 64, 36, 64)   36928       batch_normalization_17[0][0]
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 64, 36, 64)   256         conv2d_25[0][0]
__________________________________________________________________________________________________
leaky_re_lu_18 (LeakyReLU)      (None, 64, 36, 64)   0           batch_normalization_18[0][0]
__________________________________________________________________________________________________
multiply (Multiply)             (None, 64, 36, 64)   0           leaky_re_lu_17[0][0]
                                                                 leaky_re_lu_18[0][0]
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 64, 36, 64)   36928       multiply[0][0]
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 64, 36, 64)   256         conv2d_26[0][0]
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 64, 36, 64)   36928       batch_normalization_19[0][0]
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 64, 36, 64)   256         conv2d_27[0][0]
__________________________________________________________________________________________________
leaky_re_lu_19 (LeakyReLU)      (None, 64, 36, 64)   0           batch_normalization_20[0][0]
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 64, 36, 64)   0           multiply[0][0]
                                                                 leaky_re_lu_19[0][0]
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 64, 36, 64)   36928       multiply_1[0][0]
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 64, 36, 64)   256         conv2d_28[0][0]
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 64, 36, 64)   36928       batch_normalization_21[0][0]
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 64, 36, 64)   256         conv2d_29[0][0]
__________________________________________________________________________________________________
leaky_re_lu_20 (LeakyReLU)      (None, 64, 36, 64)   0           batch_normalization_22[0][0]
__________________________________________________________________________________________________
multiply_2 (Multiply)           (None, 64, 36, 64)   0           multiply_1[0][0]
                                                                 leaky_re_lu_20[0][0]
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 64, 36, 64)   36928       multiply_2[0][0]
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 64, 36, 64)   256         conv2d_30[0][0]
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 64, 36, 64)   36928       batch_normalization_23[0][0]
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 64, 36, 64)   256         conv2d_31[0][0]
__________________________________________________________________________________________________
leaky_re_lu_21 (LeakyReLU)      (None, 64, 36, 64)   0           batch_normalization_24[0][0]
__________________________________________________________________________________________________
multiply_3 (Multiply)           (None, 64, 36, 64)   0           multiply_2[0][0]
                                                                 leaky_re_lu_21[0][0]
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 64, 36, 64)   36928       multiply_3[0][0]
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 64, 36, 64)   256         conv2d_32[0][0]
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 64, 36, 64)   36928       batch_normalization_25[0][0]
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 64, 36, 64)   256         conv2d_33[0][0]
__________________________________________________________________________________________________
leaky_re_lu_22 (LeakyReLU)      (None, 64, 36, 64)   0           batch_normalization_26[0][0]
__________________________________________________________________________________________________
multiply_4 (Multiply)           (None, 64, 36, 64)   0           multiply_3[0][0]
                                                                 leaky_re_lu_22[0][0]
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 64, 36, 64)   36928       multiply_4[0][0]
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 64, 36, 64)   256         conv2d_34[0][0]
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 64, 36, 64)   36928       batch_normalization_27[0][0]
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 64, 36, 64)   256         conv2d_35[0][0]
__________________________________________________________________________________________________
leaky_re_lu_23 (LeakyReLU)      (None, 64, 36, 64)   0           batch_normalization_28[0][0]
__________________________________________________________________________________________________
multiply_5 (Multiply)           (None, 64, 36, 64)   0           multiply_4[0][0]
                                                                 leaky_re_lu_23[0][0]
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 64, 36, 64)   36928       multiply_5[0][0]
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 64, 36, 64)   256         conv2d_36[0][0]
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, 64, 36, 64)   36928       batch_normalization_29[0][0]
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 64, 36, 64)   256         conv2d_37[0][0]
__________________________________________________________________________________________________
leaky_re_lu_24 (LeakyReLU)      (None, 64, 36, 64)   0           batch_normalization_30[0][0]
__________________________________________________________________________________________________
multiply_6 (Multiply)           (None, 64, 36, 64)   0           multiply_5[0][0]
                                                                 leaky_re_lu_24[0][0]
__________________________________________________________________________________________________
conv2d_38 (Conv2D)              (None, 64, 36, 64)   36928       multiply_6[0][0]
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 64, 36, 64)   256         conv2d_38[0][0]
__________________________________________________________________________________________________
conv2d_39 (Conv2D)              (None, 64, 36, 64)   36928       batch_normalization_31[0][0]
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 64, 36, 64)   256         conv2d_39[0][0]
__________________________________________________________________________________________________
leaky_re_lu_25 (LeakyReLU)      (None, 64, 36, 64)   0           batch_normalization_32[0][0]
__________________________________________________________________________________________________
multiply_7 (Multiply)           (None, 64, 36, 64)   0           multiply_6[0][0]
                                                                 leaky_re_lu_25[0][0]
__________________________________________________________________________________________________
conv2d_40 (Conv2D)              (None, 64, 36, 64)   36928       multiply_7[0][0]
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 64, 36, 64)   256         conv2d_40[0][0]
__________________________________________________________________________________________________
conv2d_41 (Conv2D)              (None, 64, 36, 64)   36928       batch_normalization_33[0][0]
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 64, 36, 64)   256         conv2d_41[0][0]
__________________________________________________________________________________________________
leaky_re_lu_26 (LeakyReLU)      (None, 64, 36, 64)   0           batch_normalization_34[0][0]
__________________________________________________________________________________________________
multiply_8 (Multiply)           (None, 64, 36, 64)   0           multiply_7[0][0]
                                                                 leaky_re_lu_26[0][0]
__________________________________________________________________________________________________
conv2d_42 (Conv2D)              (None, 64, 36, 64)   36928       multiply_8[0][0]
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, 64, 36, 64)   256         conv2d_42[0][0]
__________________________________________________________________________________________________
conv2d_43 (Conv2D)              (None, 64, 36, 64)   36928       batch_normalization_35[0][0]
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, 64, 36, 64)   256         conv2d_43[0][0]
__________________________________________________________________________________________________
leaky_re_lu_27 (LeakyReLU)      (None, 64, 36, 64)   0           batch_normalization_36[0][0]
__________________________________________________________________________________________________
multiply_9 (Multiply)           (None, 64, 36, 64)   0           multiply_8[0][0]
                                                                 leaky_re_lu_27[0][0]
__________________________________________________________________________________________________
conv2d_44 (Conv2D)              (None, 64, 36, 64)   36928       multiply_9[0][0]
__________________________________________________________________________________________________
batch_normalization_37 (BatchNo (None, 64, 36, 64)   256         conv2d_44[0][0]
__________________________________________________________________________________________________
conv2d_45 (Conv2D)              (None, 64, 36, 64)   36928       batch_normalization_37[0][0]
__________________________________________________________________________________________________
batch_normalization_38 (BatchNo (None, 64, 36, 64)   256         conv2d_45[0][0]
__________________________________________________________________________________________________
leaky_re_lu_28 (LeakyReLU)      (None, 64, 36, 64)   0           batch_normalization_38[0][0]
__________________________________________________________________________________________________
multiply_10 (Multiply)          (None, 64, 36, 64)   0           multiply_9[0][0]
                                                                 leaky_re_lu_28[0][0]
__________________________________________________________________________________________________
conv2d_46 (Conv2D)              (None, 64, 36, 64)   36928       multiply_10[0][0]
__________________________________________________________________________________________________
batch_normalization_39 (BatchNo (None, 64, 36, 64)   256         conv2d_46[0][0]
__________________________________________________________________________________________________
conv2d_47 (Conv2D)              (None, 64, 36, 64)   36928       batch_normalization_39[0][0]
__________________________________________________________________________________________________
batch_normalization_40 (BatchNo (None, 64, 36, 64)   256         conv2d_47[0][0]
__________________________________________________________________________________________________
leaky_re_lu_29 (LeakyReLU)      (None, 64, 36, 64)   0           batch_normalization_40[0][0]
__________________________________________________________________________________________________
multiply_11 (Multiply)          (None, 64, 36, 64)   0           multiply_10[0][0]
                                                                 leaky_re_lu_29[0][0]
__________________________________________________________________________________________________
conv2d_48 (Conv2D)              (None, 64, 36, 64)   36928       multiply_11[0][0]
__________________________________________________________________________________________________
batch_normalization_41 (BatchNo (None, 64, 36, 64)   256         conv2d_48[0][0]
__________________________________________________________________________________________________
conv2d_49 (Conv2D)              (None, 64, 36, 64)   36928       batch_normalization_41[0][0]
__________________________________________________________________________________________________
batch_normalization_42 (BatchNo (None, 64, 36, 64)   256         conv2d_49[0][0]
__________________________________________________________________________________________________
leaky_re_lu_30 (LeakyReLU)      (None, 64, 36, 64)   0           batch_normalization_42[0][0]
__________________________________________________________________________________________________
multiply_12 (Multiply)          (None, 64, 36, 64)   0           multiply_11[0][0]
                                                                 leaky_re_lu_30[0][0]
__________________________________________________________________________________________________
conv2d_50 (Conv2D)              (None, 64, 36, 64)   36928       multiply_12[0][0]
__________________________________________________________________________________________________
batch_normalization_43 (BatchNo (None, 64, 36, 64)   256         conv2d_50[0][0]
__________________________________________________________________________________________________
conv2d_51 (Conv2D)              (None, 64, 36, 64)   36928       batch_normalization_43[0][0]
__________________________________________________________________________________________________
batch_normalization_44 (BatchNo (None, 64, 36, 64)   256         conv2d_51[0][0]
__________________________________________________________________________________________________
leaky_re_lu_31 (LeakyReLU)      (None, 64, 36, 64)   0           batch_normalization_44[0][0]
__________________________________________________________________________________________________
multiply_13 (Multiply)          (None, 64, 36, 64)   0           multiply_12[0][0]
                                                                 leaky_re_lu_31[0][0]
__________________________________________________________________________________________________
conv2d_52 (Conv2D)              (None, 64, 36, 64)   36928       multiply_13[0][0]
__________________________________________________________________________________________________
batch_normalization_45 (BatchNo (None, 64, 36, 64)   256         conv2d_52[0][0]
__________________________________________________________________________________________________
conv2d_53 (Conv2D)              (None, 64, 36, 64)   36928       batch_normalization_45[0][0]
__________________________________________________________________________________________________
batch_normalization_46 (BatchNo (None, 64, 36, 64)   256         conv2d_53[0][0]
__________________________________________________________________________________________________
leaky_re_lu_32 (LeakyReLU)      (None, 64, 36, 64)   0           batch_normalization_46[0][0]
__________________________________________________________________________________________________
multiply_14 (Multiply)          (None, 64, 36, 64)   0           multiply_13[0][0]
                                                                 leaky_re_lu_32[0][0]
__________________________________________________________________________________________________
conv2d_54 (Conv2D)              (None, 64, 36, 64)   36928       multiply_14[0][0]
__________________________________________________________________________________________________
batch_normalization_47 (BatchNo (None, 64, 36, 64)   256         conv2d_54[0][0]
__________________________________________________________________________________________________
conv2d_55 (Conv2D)              (None, 64, 36, 64)   36928       batch_normalization_47[0][0]
__________________________________________________________________________________________________
batch_normalization_48 (BatchNo (None, 64, 36, 64)   256         conv2d_55[0][0]
__________________________________________________________________________________________________
leaky_re_lu_33 (LeakyReLU)      (None, 64, 36, 64)   0           batch_normalization_48[0][0]
__________________________________________________________________________________________________
multiply_15 (Multiply)          (None, 64, 36, 64)   0           multiply_14[0][0]
                                                                 leaky_re_lu_33[0][0]
__________________________________________________________________________________________________
conv2d_56 (Conv2D)              (None, 64, 36, 64)   36928       multiply_15[0][0]
__________________________________________________________________________________________________
batch_normalization_49 (BatchNo (None, 64, 36, 64)   256         conv2d_56[0][0]
__________________________________________________________________________________________________
multiply_16 (Multiply)          (None, 64, 36, 64)   0           batch_normalization_49[0][0]
                                                                 leaky_re_lu_17[0][0]
__________________________________________________________________________________________________
conv2d_57 (Conv2D)              (None, 64, 36, 256)  147712      multiply_16[0][0]
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, 128, 72, 256) 0           conv2d_57[0][0]
__________________________________________________________________________________________________
conv2d_58 (Conv2D)              (None, 128, 72, 256) 590080      up_sampling2d[0][0]
__________________________________________________________________________________________________
leaky_re_lu_34 (LeakyReLU)      (None, 128, 72, 256) 0           conv2d_58[0][0]
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 256, 144, 256 0           leaky_re_lu_34[0][0]
__________________________________________________________________________________________________
conv2d_59 (Conv2D)              (None, 256, 144, 3)  771         up_sampling2d_1[0][0]
==================================================================================================
Total params: 4,230,435
Trainable params: 4,221,539
Non-trainable params: 8,896
__________________________________________________________________________________________________
None